APILoggingFile.log

WSC: Creating a new connection to https://login.salesforce.com/services/Soap/u/41.0/ Proxy = DIRECT username null
WSC: Connection configured to have request properties {SOAPAction=[""], Accept=[text/xml], Content-Encoding=[gzip], User-Agent=[Salesforce Web Service Connector For Java/1.0], Accept-Encoding=[gzip], Content-Type=[text/xml; charset=UTF-8]}
------------ Request start   ----------
<?xml version="1.0" encoding="UTF-8"?><env:Envelope
   xmlns:env="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema"
   xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
 <env:Body>
  <m:login xmlns:m="urn:partner.soap.sforce.com" xmlns:sobj="urn:sobject.partner.soap.sforce.com">
   <m:username>thomaswoodhouse93@gmail.com</m:username>
   <m:password>Carlow2017@!sAK41dcgPhGvUtVfMsMS4x2C0</m:password>
  </m:login>
 </env:Body>
</env:Envelope>
------------ Request end   ----------
null=[HTTP/1.1 200 OK]
Cache-Control=[no-cache,must-revalidate,max-age=0,no-store,private]
Content-Encoding=[gzip]
Vary=[Accept-Encoding]
Set-Cookie=[BrowserId=RztqFnTRQ9emFHHfPHmavw;Path=/;Domain=.salesforce.com;Expires=Mon, 12-Feb-2018 15:30:29 GMT;Max-Age=5184000]
Expires=[Thu, 01 Jan 1970 00:00:00 GMT]
Content-Length=[822]
Date=[Thu, 14 Dec 2017 15:30:29 GMT]
Content-Type=[text/xml; charset=utf-8]
------------ Response start ----------
  <?xml version="1.0" encoding="UTF-8"?>
    <soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns="urn:partner.soap.sforce.com" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
      <soapenv:Body>
        <loginResponse>
          <result>
            <metadataServerUrl>https://thomaswoodhouse-dev-ed.my.salesforce.com/services/Soap/m/41.0/00D24000000opgR</metadataServerUrl>
            <passwordExpired>false</passwordExpired>
            <sandbox>false</sandbox>
            <serverUrl>https://thomaswoodhouse-dev-ed.my.salesforce.com/services/Soap/u/41.0/00D24000000opgR</serverUrl>
            <sessionId>00D24000000opgR!ARcAQDkl6M4u6vEbja2QD.svR764y0ita5orZs_oQLR2JD7JRmHbLastTntgaW.lPg8LpFsKVDzcyJakg0gwOAvthkFZCqnc</sessionId>
            <userId>005240000011St1AAE</userId>
            <userInfo>
              <accessibilityMode>false</accessibilityMode>
              <chatterExternal>false</chatterExternal>
              <currencySymbol>$</currencySymbol>
              <orgAttachmentFileSizeLimit>5242880</orgAttachmentFileSizeLimit>
              <orgDefaultCurrencyIsoCode>USD</orgDefaultCurrencyIsoCode>
              <orgDefaultCurrencyLocale>en_US</orgDefaultCurrencyLocale>
              <orgDisallowHtmlAttachments>false</orgDisallowHtmlAttachments>
              <orgHasPersonAccounts>false</orgHasPersonAccounts>
              <organizationId>00D24000000opgREAQ</organizationId>
              <organizationMultiCurrency>false</organizationMultiCurrency>
              <organizationName>UNUM Test Org</organizationName>
              <profileId>00e240000012wqDAAQ</profileId>
              <roleId>00E24000000tOriEAE</roleId>
              <sessionSecondsValid>3600</sessionSecondsValid>
              <userDefaultCurrencyIsoCode xsi:nil="true"/>
                <userEmail>thomaswoodhouse93@gmail.com</userEmail>
                <userFullName>Tommy Woodhouse</userFullName>
                <userId>005240000011St1AAE</userId>
                <userLanguage>en_US</userLanguage>
                <userLocale>en_US</userLocale>
                <userName>thomaswoodhouse93@gmail.com</userName>
                <userTimeZone>America/Caracas</userTimeZone>
                <userType>Standard</userType>
                <userUiSkin>Theme3</userUiSkin>
            </userInfo>
          </result>
        </loginResponse>
      </soapenv:Body>
    </soapenv:Envelope>
------------ Response end   ----------
WSC: Creating a new connection to https://thomaswoodhouse-dev-ed.my.salesforce.com/services/Soap/u/41.0/00D24000000opgR Proxy = DIRECT username null
WSC: Connection configured to have request properties {SOAPAction=[""], Accept=[text/xml], Content-Encoding=[gzip], User-Agent=[Salesforce Web Service Connector For Java/1.0], Accept-Encoding=[gzip], Content-Type=[text/xml; charset=UTF-8]}
------------ Request start   ----------
<?xml version="1.0" encoding="UTF-8"?><env:Envelope
   xmlns:env="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema"
   xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
 <env:Header>
  <SessionHeader xmlns="urn:partner.soap.sforce.com">
   <sessionId>00D24000000opgR!ARcAQDkl6M4u6vEbja2QD.svR764y0ita5orZs_oQLR2JD7JRmHbLastTntgaW.lPg8LpFsKVDzcyJakg0gwOAvthkFZCqnc</sessionId>
  </SessionHeader>
 </env:Header>
 <env:Body>
  <m:create xmlns:m="urn:partner.soap.sforce.com" xmlns:sobj="urn:sobject.partner.soap.sforce.com">
   <m:sObjects>
    <sobj:type xsi:type="xsd:string">Account</sobj:type>
    <sobj:Name xsi:type="xsd:string">Test Account </sobj:Name>
   </m:sObjects>
  </m:create>
 </env:Body>
</env:Envelope>
------------ Request end   ----------
Transfer-Encoding=[chunked]
null=[HTTP/1.1 200 OK]
Cache-Control=[no-cache,must-revalidate,max-age=0,no-store,private]
Content-Encoding=[gzip]
Vary=[Accept-Encoding]
Set-Cookie=[BrowserId=PVJGcRRZTSWb95c9J902wg;Path=/;Domain=.salesforce.com;Expires=Mon, 12-Feb-2018 15:30:31 GMT;Max-Age=5184000]
Expires=[Thu, 01 Jan 1970 00:00:00 GMT]
Date=[Thu, 14 Dec 2017 15:30:31 GMT]
Content-Type=[text/xml; charset=utf-8]
------------ Response start ----------
  <?xml version="1.0" encoding="UTF-8"?>
    <soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns="urn:partner.soap.sforce.com">
      <soapenv:Header>
        <LimitInfoHeader>
          <limitInfo>
            <current>9</current>
            <limit>15000</limit>
            <type>API REQUESTS</type>
        </limitInfo>
      </LimitInfoHeader>
    </soapenv:Header>
      <soapenv:Body>
        <createResponse>
          <result>
            <id>0011p00001MnasVAAR</id>
            <success>true</success>
        </result>
      </createResponse>
    </soapenv:Body>
  </soapenv:Envelope>
------------ Response end   ----------
